//var.c:局部变量和全局变量演示
#include <stdio.h>
void C(void) {
    //printf("B函数:g_a = %d\n", g_a); //不可以
}
int g_a = 520; //定义初始化全局变量,建议名称以"g_"开头(g=global=全局)
               //从定义的地方开始依次向下所有的函数都可以访问
               //当运行程序时(./var)就已经分配好内存了,直到程序结束内存才会被回收
void A(void) {
    printf("A函数:g_a = %d\n", g_a); //可以
}
//定义add函数
int add(int a, int b) {//a,b同样也是局部变量,只能用于函数内部,出了函数就立刻无效
                        //当调用此函数时分配内存当函数执行完毕内存也会被回收
    return a + b;
}
void B(void) {
    static int a = 520;//定义初始化静态局部变量,只能用于函数内部,出了函数不能访问
                        //但是其内存是程序运行时(./var)时就已经分配好,直到程序结束
                        //其内存才会被回收,只要程序不退出他的内存一直在
    printf("B函数:a = %d\n", a); //可以
    a = 10;
}
int main(void) {
    //printf("a = %d\n", a); //不可以访问
    int a = 520; //定义初始化局部变量,从定义的地方开始依次向下所有的代码都可以访问
                 //一旦出了main函数就不能访问了,同样它的内存也会被回收
    printf("main函数:a = %d\n", a); //可以访问
    if(a == 521) {
        int b = 521; //定义初始化局部变量,b是从定义的地方开始依次向下所有代码都可以访问
                     //直到最近的花括号结束访问并且对应的内存也会被回收
        printf("main函数:b = %d\n", b);
    }
    //printf("main函数:b = %d\n", b); //不可以访问
    printf("main函数:g_a = %d\n", g_a); //可以
    A();
    B();
    B();
    return 0;
}
